; domain
(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S3 S4 S5 S6 S7 S8 S9 S10 S11 S12 S13 S14 S15 S16 S17 S18 S19 S20 S21 S22 - secondary
	P1 P2 - primary
)
(:init
	(conn S3 P2)
	(conn S3 S15)
	(conn S4 S9)
	(conn S4 S14)
	(conn S5 S14)
	(conn S5 S17)
	(conn S6 S15)
	(conn S6 S19)
	(conn S7 S11)
	(conn S7 S22)
	(conn S8 S10)
	(conn S8 S11)
	(conn S9 S20)
	(conn S10 S18)
	(conn S12 S13)
	(conn S12 S20)
	(conn S13 P1)
	(conn S16 P1)
	(conn S16 S21)
	(conn S17 P2)
	(conn S18 P1)
	(conn S19 P1)
	(conn S21 P2)
	(conn S22 P2)
	(close S3 P2)
	(close S3 S15)
	(close S4 S9)
	(close S4 S14)
	(close S5 S17)
	(close S6 S19)
	(close S7 S22)
	(close S8 S10)
	(close S8 S11)
	(close S9 S20)
	(close S10 S18)
	(close S12 S13)
	(close S12 S20)
	(close S13 P1)
	(close S16 P1)
	(close S17 P2)
	(close S18 P1)
	(close S19 P1)
	(close S21 P2)
	(close S22 P2)
	(buildable S4 S20)
	(buildable S5 S9)
	(buildable S5 S15)
	(buildable S6 S16)
	(buildable S7 S8)
	(buildable S9 P1)
	(buildable S11 P1)
	(buildable S11 S16)
	(buildable S14 S17)
	(buildable S19 S21)
	(mutable S4 S9)
	(mutable S5 S14)
	(mutable S5 S17)
	(mutable S6 S15)
	(mutable S7 S11)
	(mutable S8 S11)
	(mutable S9 S20)
	(mutable S16 P1)
	(mutable S16 S21)
	(mutable S19 P1)
	(le P1 P2)
	(le S3 P1)
	(le S3 P2)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S3 S7)
	(le S3 S8)
	(le S3 S9)
	(le S3 S10)
	(le S3 S11)
	(le S3 S12)
	(le S3 S13)
	(le S3 S14)
	(le S3 S15)
	(le S3 S16)
	(le S3 S17)
	(le S3 S18)
	(le S3 S19)
	(le S3 S20)
	(le S3 S21)
	(le S3 S22)
	(le S4 P1)
	(le S4 P2)
	(le S4 S5)
	(le S4 S6)
	(le S4 S7)
	(le S4 S8)
	(le S4 S9)
	(le S4 S10)
	(le S4 S11)
	(le S4 S12)
	(le S4 S13)
	(le S4 S14)
	(le S4 S15)
	(le S4 S16)
	(le S4 S17)
	(le S4 S18)
	(le S4 S19)
	(le S4 S20)
	(le S4 S21)
	(le S4 S22)
	(le S5 P1)
	(le S5 P2)
	(le S5 S6)
	(le S5 S7)
	(le S5 S8)
	(le S5 S9)
	(le S5 S10)
	(le S5 S11)
	(le S5 S12)
	(le S5 S13)
	(le S5 S14)
	(le S5 S15)
	(le S5 S16)
	(le S5 S17)
	(le S5 S18)
	(le S5 S19)
	(le S5 S20)
	(le S5 S21)
	(le S5 S22)
	(le S6 P1)
	(le S6 P2)
	(le S6 S7)
	(le S6 S8)
	(le S6 S9)
	(le S6 S10)
	(le S6 S11)
	(le S6 S12)
	(le S6 S13)
	(le S6 S14)
	(le S6 S15)
	(le S6 S16)
	(le S6 S17)
	(le S6 S18)
	(le S6 S19)
	(le S6 S20)
	(le S6 S21)
	(le S6 S22)
	(le S7 P1)
	(le S7 P2)
	(le S7 S8)
	(le S7 S9)
	(le S7 S10)
	(le S7 S11)
	(le S7 S12)
	(le S7 S13)
	(le S7 S14)
	(le S7 S15)
	(le S7 S16)
	(le S7 S17)
	(le S7 S18)
	(le S7 S19)
	(le S7 S20)
	(le S7 S21)
	(le S7 S22)
	(le S8 P1)
	(le S8 P2)
	(le S8 S9)
	(le S8 S10)
	(le S8 S11)
	(le S8 S12)
	(le S8 S13)
	(le S8 S14)
	(le S8 S15)
	(le S8 S16)
	(le S8 S17)
	(le S8 S18)
	(le S8 S19)
	(le S8 S20)
	(le S8 S21)
	(le S8 S22)
	(le S9 P1)
	(le S9 P2)
	(le S9 S10)
	(le S9 S11)
	(le S9 S12)
	(le S9 S13)
	(le S9 S14)
	(le S9 S15)
	(le S9 S16)
	(le S9 S17)
	(le S9 S18)
	(le S9 S19)
	(le S9 S20)
	(le S9 S21)
	(le S9 S22)
	(le S10 P1)
	(le S10 P2)
	(le S10 S11)
	(le S10 S12)
	(le S10 S13)
	(le S10 S14)
	(le S10 S15)
	(le S10 S16)
	(le S10 S17)
	(le S10 S18)
	(le S10 S19)
	(le S10 S20)
	(le S10 S21)
	(le S10 S22)
	(le S11 P1)
	(le S11 P2)
	(le S11 S12)
	(le S11 S13)
	(le S11 S14)
	(le S11 S15)
	(le S11 S16)
	(le S11 S17)
	(le S11 S18)
	(le S11 S19)
	(le S11 S20)
	(le S11 S21)
	(le S11 S22)
	(le S12 P1)
	(le S12 P2)
	(le S12 S13)
	(le S12 S14)
	(le S12 S15)
	(le S12 S16)
	(le S12 S17)
	(le S12 S18)
	(le S12 S19)
	(le S12 S20)
	(le S12 S21)
	(le S12 S22)
	(le S13 P1)
	(le S13 P2)
	(le S13 S14)
	(le S13 S15)
	(le S13 S16)
	(le S13 S17)
	(le S13 S18)
	(le S13 S19)
	(le S13 S20)
	(le S13 S21)
	(le S13 S22)
	(le S14 P1)
	(le S14 P2)
	(le S14 S15)
	(le S14 S16)
	(le S14 S17)
	(le S14 S18)
	(le S14 S19)
	(le S14 S20)
	(le S14 S21)
	(le S14 S22)
	(le S15 P1)
	(le S15 P2)
	(le S15 S16)
	(le S15 S17)
	(le S15 S18)
	(le S15 S19)
	(le S15 S20)
	(le S15 S21)
	(le S15 S22)
	(le S16 P1)
	(le S16 P2)
	(le S16 S17)
	(le S16 S18)
	(le S16 S19)
	(le S16 S20)
	(le S16 S21)
	(le S16 S22)
	(le S17 P1)
	(le S17 P2)
	(le S17 S18)
	(le S17 S19)
	(le S17 S20)
	(le S17 S21)
	(le S17 S22)
	(le S18 P1)
	(le S18 P2)
	(le S18 S19)
	(le S18 S20)
	(le S18 S21)
	(le S18 S22)
	(le S19 P1)
	(le S19 P2)
	(le S19 S20)
	(le S19 S21)
	(le S19 S22)
	(le S20 P1)
	(le S20 P2)
	(le S20 S21)
	(le S20 S22)
	(le S21 P1)
	(le S21 P2)
	(le S21 S22)
	(le S22 P1)
	(le S22 P2)
)
(:goal
	(and
		(conn S3 P2)
		(conn S3 S15)
		(conn S4 S14)
		(conn S4 S20)
		(conn S5 S9)
		(conn S5 S15)
		(conn S6 S16)
		(conn S6 S19)
		(conn S7 S8)
		(conn S7 S22)
		(conn S8 S10)
		(conn S9 P1)
		(conn S10 S18)
		(conn S11 P1)
		(conn S11 S16)
		(conn S12 S13)
		(conn S12 S20)
		(conn S13 P1)
		(conn S14 S17)
		(conn S17 P2)
		(conn S18 P1)
		(conn S19 S21)
		(conn S21 P2)
		(conn S22 P2)
		(not (conn S4 S9))
		(not (conn S5 S14))
		(not (conn S5 S17))
		(not (conn S6 S15))
		(not (conn S7 S11))
		(not (conn S8 S11))
		(not (conn S9 S20))
		(not (conn S16 P1))
		(not (conn S16 S21))
		(not (conn S19 P1))
		(close S3 P2)
		(close S3 S15)
		(close S4 S20)
		(close S5 S9)
		(close S6 S16)
		(close S7 S22)
		(close S8 S10)
		(close S9 P1)
		(close S10 S18)
		(close S11 P1)
		(close S11 S16)
		(close S12 S13)
		(close S12 S20)
		(close S13 P1)
		(close S14 S17)
		(close S17 P2)
		(close S18 P1)
		(close S19 S21)
		(close S21 P2)
		(close S22 P2)
		(not (close S4 S14))
		(not (close S5 S15))
		(not (close S6 S19))
		(not (close S7 S8))
	)
)
)

; plan
1. (inss s19 s21)
   added: (conn s19 s21) (full s19) (full s21)
   goals met: 29 of 58
2. (inss s4 s20)
   added: (conn s4 s20) (full s4) (full s20)
   goals met: 30 of 58
3. (inss s14 s17)
   added: (conn s14 s17) (full s14) (full s17)
   goals met: 31 of 58
4. (inss s6 s16)
   added: (conn s6 s16) (full s6) (full s16)
   goals met: 32 of 58
5. (dels s16 s21)
   deleted: (conn s16 s21) (full s16) (full s21)
   added: (rem s16 s21)
   goals met: 33 of 58
6. (inss s5 s15)
   added: (conn s5 s15) (full s5) (full s15)
   goals met: 34 of 58
7. (dels s5 s14)
   deleted: (conn s5 s14) (full s5) (full s14)
   added: (rem s5 s14)
   goals met: 35 of 58
8. (dels s6 s15)
   deleted: (conn s6 s15) (full s6) (full s15)
   added: (rem s6 s15)
   goals met: 36 of 58
9. (inss s7 s8)
   added: (conn s7 s8) (full s7) (full s8)
   goals met: 37 of 58
10. (inss s5 s9)
   added: (conn s5 s9) (full s5) (full s9)
   goals met: 38 of 58
11. (inss s11 s16)
   added: (conn s11 s16) (full s11) (full s16)
   goals met: 39 of 58
12. (dels s7 s11)
   deleted: (conn s7 s11) (full s7) (full s11)
   added: (rem s7 s11)
   goals met: 40 of 58
13. (insp s11 p1)
   added: (conn s11 p1) (full s11)
   goals met: 41 of 58
14. (sw s19 p1 s21)
   deleted: (close s19 p1)
   added: (close s19 s21)
   goals met: 42 of 58
15. (delp s19 p1)
   deleted: (conn s19 p1) (full s19)
   added: (rem s19 p1)
   goals met: 43 of 58
16. (sw s16 p1 s11)
   deleted: (close s16 p1)
   added: (close s11 s16)
   goals met: 44 of 58
17. (delp s16 p1)
   deleted: (conn s16 p1) (full s16)
   added: (rem s16 p1)
   goals met: 45 of 58
18. (sw s4 s9 s20)
   deleted: (close s4 s9)
   added: (close s4 s20)
   goals met: 46 of 58
19. (dels s4 s9)
   deleted: (conn s4 s9) (full s4) (full s9)
   added: (rem s4 s9)
   goals met: 47 of 58
20. (insp s9 p1)
   added: (conn s9 p1) (full s9)
   goals met: 48 of 58
21. (sw s9 s20 p1)
   deleted: (close s9 s20)
   added: (close s9 p1)
   goals met: 49 of 58
22. (dels s9 s20)
   deleted: (conn s9 s20) (full s9) (full s20)
   added: (rem s9 s20)
   goals met: 50 of 58
23. (sw s11 s8 p1)
   deleted: (close s8 s11)
   added: (close s11 p1)
   goals met: 51 of 58
24. (dels s8 s11)
   deleted: (conn s8 s11) (full s8) (full s11)
   added: (rem s8 s11)
   goals met: 52 of 58
25. (sw s14 s4 s17)
   deleted: (close s4 s14)
   added: (close s14 s17)
   goals met: 54 of 58
26. (sw s5 s17 s15)
   deleted: (close s5 s17)
   added: (close s5 s15)
   goals met: 53 of 58
27. (dels s5 s17)
   deleted: (conn s5 s17) (full s5) (full s17)
   added: (rem s5 s17)
   goals met: 54 of 58
28. (sw s5 s15 s9)
   deleted: (close s5 s15)
   added: (close s5 s9)
   goals met: 56 of 58
29. (sw s6 s19 s16)
   deleted: (close s6 s19)
   added: (close s6 s16)
   goals met: 58 of 58
